request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getHelloRequest>
         <gs:greetingrequest>Hello World!</gs:greetingrequest>
      </gs:getHelloRequest>
   </soapenv:Body>
</soapenv:Envelope>